// 1. Створити масив з трьох чисел. Змінити значення другого елемента масиву на 10.

// let list = [2, 1, 0];
// list[1] = 10;
// console.log(list);

// 2. Створити масив із трьох рядків. Додати до масиву ще одну рядків.

// let veg = ["tomato", "cucumber","Cabbage" ];
// veg.push("onion");
// console.log(veg);

// 3. Створити скрипт який поверне суму всіх чисел в масиві.

// let num = [12, 13, 14];
// let sum = 0;
// for (let i = 0; i < num.length; i += 1){
//     sum += num[i];
// }
// console.log(sum);

 
// 4. Створити масив з 5-ти чисел. Вивести на екран всі елементи масиву за допомогою циклу for.

// let num = [1, 2, 3, 4, 5];
// for (let i = 0; i < num.length; i+= 1){
//     console.log(num[i]);
    
// }

// 5. Створити масив із 5-ти рядків. Вивести на екран кожен рядокз масиву, який містить більше 5-ти символів.

// let fruits = ["apple", "orange", "mango", "melon", "kiwi" ];
// for (let i = 0; i < fruits.length; i+= 1){
//     if (fruits[i].length > 5) {
//         console.log(fruits[i]);
        
//     }

    
// }


// 6. Створити масив з 10-ти чисел. Знайти та вивести на екран максимальне значення з масиву.

// let num = [10, 1, 2, 33, 444, 121, 2131, 43, 31, 1, 23, 4556, 66, 66, 732];
// let max = num[0];

// for (let i = 1; i < num.length; i += 1){
//     if (num[i] > max){
//         max = num[i];
//     }
// }
// console.log(max);

// 7. Створити масив з 10-ти чисел. Знайти всі парні числа в масиві та вивести їх на екран.


let num = [10, 1, 2, 33, 444, 121, 2131, 43, 31, 1, 23, 4556, 66, 66, 732];
for (let i = 0; i < num.length; i += 1){
    if (num[i] % 2 === 0){
         console.log(num[i]);
         

    }
}
